0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    inlet
    {
        type		fixedValue;
        value		uniform (0 0 0);
    }
    bottom
    {
        type		fixedValue;
        value		uniform (0 0 0);
    }
    myCircle
    {
        type codedFixedValue;

        value uniform (0 0 0);

        name oscillatingMulti;

        
    }

    outlet
    {
        type		fixedValue;
        value		uniform (0 0 0);
    }
    atmosphere
    {
        type		fixedValue;
        value		uniform (0 0 0);
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //