constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

relaxationNames     ( inlet outlet );

initializationName  outlet;

externalForcing     oceanWave3D;

externalForcingCoeffs
{
    waveType            oceanWave3D;

    nIntervals          1;
    startTimes          nonuniform List<scalar>
    1
    (
        0.02
    );
    endTimes            nonuniform List<scalar>
    1
    (
        35
    );

    rampInterval        off;

    mappingZone         inlet;
    translateOpenFoamMesh ( 99 0 0 );
}

inletCoeffs
{
    waveType            externalSource;

    relaxationZone
    {
        relaxationScheme    Empty;
        relaxationShape     Rectangular;
        Tsoft               0.1;
        relaxType           INLET;
        startX              ( 1 0 -1 );
        endX                ( 1 0 1 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               0.1;

    relaxationZone
    {
        relaxationScheme    Empty;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           OUTLET;
        startX              ( 21 0 -1 );
        endX                ( 21 0 1 );
        orientation         ( 1 0 0 );
    }
}



// ************************************************************************* //
