system/codeDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      codeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
oscillatingMulti
{
code
        #{
            const scalar t = this->db().time().value();
            
            static const int N = 99;   

...
                /* paste Python-generated a list here */
            };

            static const scalar w2[N] = {3.064163501319499, 3.1606326090660946, 3.2571017168126906, 3.353570824559286, 3.4500399323058817, 3.5465090400524772, 3.642978147799073, 3.739447255545669, 3.8359163632922644, 3.93238547103886, 4.028854578785456, 4.125323686532051, 4.221792794278647, 4.318261902025243, 4.414731009771838, 4.511200117518435, 4.607669225265029, 4.704138333011626, 4.80060744075822, 4.897076548504817, 4.993545656251412, 5.090014763998008, 5.186483871744604, 5.282952979491199, 5.379422087237795, 5.47589119498439, 5.572360302730987, 5.668829410477581, 5.765298518224178, 5.8617676259707725, 5.958236733717369, 6.0547058414639645, 6.15117494921056, 6.247644056957156, 6.344113164703751, 6.440582272450348, 6.537051380196942, 6.633520487943539, 6.729989595690133, 6.82645870343673, 6.9229278111833255, 7.019396918929921, 7.1158660266765175, 7.212335134423112, 7.308804242169709, 7.405273349916303, 7.5017424576629, 7.598211565409494, 7.694680673156091, 7.7911497809026855, 7.887618888649282, 7.9840879963958775, 8.080557104142473, 8.17702621188907, 8.273495319635664, 8.36996442738226, 8.466433535128855, 8.562902642875452, 8.659371750622046, 8.755840858368643, 8.85230996611524, 8.948779073861834, 9.04524818160843, 9.141717289355025, 9.238186397101622, 9.334655504848216, 9.431124612594813, 9.527593720341407, 9.624062828088004, 9.7205319358346, 9.817001043581195, 9.913470151327791, 10.009939259074386, 10.106408366820983, 10.202877474567577, 10.299346582314174, 10.395815690060768, 10.492284797807365, 10.588753905553961, 10.685223013300556, 10.781692121047152, 10.878161228793747, 10.974630336540343, 11.071099444286938, 11.167568552033535, 11.264037659780131, 11.360506767526726, 11.45697587527332, 11.553444983019917, 11.649914090766513, 11.746383198513108, 11.842852306259703, 11.939321414006299, 12.035790521752896, 12.132259629499492, 12.228728737246087, 12.325197844992681, 12.421666952739278, 12.518136060485874
            };

...
                /* paste Python-generated phi list here */
            };
            scalar pi = 3.141592653589793116;
            scalar y = 0;
            for (int i=0; i<N; i++)
            {
                y += a2[i] * cos(w2[i] * t + phi2[i]);
            }

            const scalar t0 = 0.0;
            const scalar t1 = 10; // ramp end time

            scalar x = (t - t0)/(t1 - t0);
            x = max(scalar(0), min(scalar(1), x)); // clamp to [0,1]

            // Quintic smootherstep (C2 smooth)
            scalar env = x*x*x*(10 - 15*x + 6*x*x);

            y*=env;


            //Info << "oscillatingMulti: t = " << t << ", y = " << y << endl;
            vector disp( 0, y, 0 );
            operator==(disp);
        #};
}


//OLDoscillatingMulti
//{
//code
 //       #{
  //          const scalar t = this->db().time().value();
   //        const scalar A1 = 0.01;
    //        const scalar A2 = 0.005;
     //       const scalar w1 = 6.28318;
       //     const scalar w2 = 4.71238;

         //   vector disp( A1*sin(w1*t) + A2*sin(w2*t), 0, 0 );
           // operator==(disp);
   //     #};
//}