system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
/*    pcorr PCG
    {
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0;
    };
    p_rgh PCG
    {
        preconditioner   DIC;
        tolerance        1e-7;
        relTol           0.001;
    };
    p_rghFinal PCG
    {
        preconditioner   DIC;
        tolerance        1e-7;
        relTol           0;
    };*/

    "(cellDisplacement|cellDisplacementFinal)"
    {
        solver          GAMG;
        tolerance       1e-5;
        relTol          0;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pcorr GAMG
    {
        tolerance        1e-7;
        relTol           0.0;

        smoother         DIC;//GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    pcorrFinal
    {
    solver          GAMG;
    tolerance       1e-7;
    relTol          0;

    smoother        DIC;
    nPreSweeps      0;
    nPostSweeps     2;
    nFinestSweeps   2;

    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
    ;}


    p_rgh GAMG
    {
        tolerance        1e-7;
        relTol           0.0;

        smoother         DIC;//GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    p_rghFinal GAMG
    {
        tolerance        1e-8;
        relTol           0.0;

        smoother         DIC;//GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-09;
        relTol           0;
    };

    UFinal PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-09;
        relTol           0;
    };

    gamma PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0;
    };
    alpha.water
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-07;
    relTol          0;

    cAlpha          1;
    nAlphaCorr      1;
    nAlphaSubCycles 1;
}


}

PISO
{
    cAlpha          1;
}

PIMPLE
{
    p_rghRefCell 0;
    p_rghRefValue 0;
    momentumPredictor yes;
    nOuterCorrectors 1; 
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
    nAlphaCorr      1;
    nAlphaSubCycles 1;
}

// ************************************************************************* //
