system/probeLocations
probeLocations
(
    (1.000000 -1.100000 -0.055000)
    (3.000000 -1.100000 -0.055000)
    (5.000000 -1.100000 -0.055000)
    (7.000000 -1.100000 -0.055000)
    (9.000000 -1.100000 -0.055000)
    (11.000000 -1.100000 -0.055000)
    (13.000000 -1.100000 -0.055000)
    (15.000000 -1.100000 -0.055000)
    (17.000000 -1.100000 -0.055000)
    (19.000000 -1.100000 -0.055000)
    (1.000000 -1.090000 -0.055000)
    (3.000000 -1.090000 -0.055000)
    (5.000000 -1.090000 -0.055000)
    (7.000000 -1.090000 -0.055000)
    (9.000000 -1.090000 -0.055000)
    (11.000000 -1.090000 -0.055000)
    (13.000000 -1.090000 -0.055000)
    (15.000000 -1.090000 -0.055000)
    (17.000000 -1.090000 -0.055000)
    (19.000000 -1.090000 -0.055000)
    (1.000000 -1.080000 -0.055000)
    (3.000000 -1.080000 -0.055000)
    (5.000000 -1.080000 -0.055000)
    (7.000000 -1.080000 -0.055000)
    (9.000000 -1.080000 -0.055000)
    (11.000000 -1.080000 -0.055000)
    (13.000000 -1.080000 -0.055000)
    (15.000000 -1.080000 -0.055000)
    (17.000000 -1.080000 -0.055000)
    (19.000000 -1.080000 -0.055000)
    (1.000000 -1.070000 -0.055000)
    (3.000000 -1.070000 -0.055000)
    (5.000000 -1.070000 -0.055000)
    (7.000000 -1.070000 -0.055000)
    (9.000000 -1.070000 -0.055000)
    (11.000000 -1.070000 -0.055000)
    (13.000000 -1.070000 -0.055000)
    (15.000000 -1.070000 -0.055000)
    (17.000000 -1.070000 -0.055000)
    (19.000000 -1.070000 -0.055000)
    (1.000000 -1.060000 -0.055000)
    (3.000000 -1.060000 -0.055000)
    (5.000000 -1.060000 -0.055000)
    (7.000000 -1.060000 -0.055000)
    (9.000000 -1.060000 -0.055000)
    (11.000000 -1.060000 -0.055000)
    (13.000000 -1.060000 -0.055000)
    (15.000000 -1.060000 -0.055000)
    (17.000000 -1.060000 -0.055000)
    (19.000000 -1.060000 -0.055000)
    (1.000000 -1.050000 -0.055000)
    (3.000000 -1.050000 -0.055000)
    (5.000000 -1.050000 -0.055000)
    (7.000000 -1.050000 -0.055000)
    (9.000000 -1.050000 -0.055000)
    (11.000000 -1.050000 -0.055000)
    (13.000000 -1.050000 -0.055000)
    (15.000000 -1.050000 -0.055000)
    (17.000000 -1.050000 -0.055000)
    (19.000000 -1.050000 -0.055000)
    (1.000000 -1.040000 -0.055000)
    (3.000000 -1.040000 -0.055000)
    (5.000000 -1.040000 -0.055000)
    (7.000000 -1.040000 -0.055000)
    (9.000000 -1.040000 -0.055000)
    (11.000000 -1.040000 -0.055000)
    (13.000000 -1.040000 -0.055000)
    (15.000000 -1.040000 -0.055000)
    (17.000000 -1.040000 -0.055000)
    (19.000000 -1.040000 -0.055000)
    (1.000000 -1.030000 -0.055000)
    (3.000000 -1.030000 -0.055000)
    (5.000000 -1.030000 -0.055000)
    (7.000000 -1.030000 -0.055000)
    (9.000000 -1.030000 -0.055000)
    (11.000000 -1.030000 -0.055000)
    (13.000000 -1.030000 -0.055000)
    (15.000000 -1.030000 -0.055000)
    (17.000000 -1.030000 -0.055000)
    (19.000000 -1.030000 -0.055000)
    (1.000000 -1.020000 -0.055000)
    (3.000000 -1.020000 -0.055000)
    (5.000000 -1.020000 -0.055000)
    (7.000000 -1.020000 -0.055000)
    (9.000000 -1.020000 -0.055000)
    (11.000000 -1.020000 -0.055000)
    (13.000000 -1.020000 -0.055000)
    (15.000000 -1.020000 -0.055000)
    (17.000000 -1.020000 -0.055000)
    (19.000000 -1.020000 -0.055000)
    (1.000000 -1.010000 -0.055000)
    (3.000000 -1.010000 -0.055000)
    (5.000000 -1.010000 -0.055000)
    (7.000000 -1.010000 -0.055000)
    (9.000000 -1.010000 -0.055000)
    (11.000000 -1.010000 -0.055000)
    (13.000000 -1.010000 -0.055000)
    (15.000000 -1.010000 -0.055000)
    (17.000000 -1.010000 -0.055000)
...
);
